{
  "created_at": "2025-08-22T16:26:56Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 137160,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86_oJC6",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 30 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to GSL. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.58 is at or below cutoff of 2.50.\n  2. Similar to C3D. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.29 is at or below cutoff of 2.50.\n  3. Similar to BED. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.20 is at or below cutoff of 2.50.\n  4. Similar to GCP. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.28 is at or below cutoff of 2.50.\n  5. Similar to DSP. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.43 is at or below cutoff of 2.50.\n  6. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to QSM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to Gen. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to Glo. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to CSDP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to GLM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to DSDP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to JLD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to ASDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to Gtk. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to GR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to GMT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to Gym. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to Git. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to GADM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  28. Similar to KSVD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  29. Similar to PSID. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  30. Similar to TSVD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-08-22T16:38:12Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/137160#issuecomment-3214971066",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86_oLK-",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "`GSDFormat` or `GSDFiles` might be more suitable names",
      "createdAt": "2025-08-22T16:42:00Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/137160#issuecomment-3214979774",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86_o-n0",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closing in favor of https://github.com/JuliaRegistries/General/pull/137164",
      "createdAt": "2025-08-22T18:04:05Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/137160#issuecomment-3215190516",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: GSD\n- Repository: https://github.com/amirabbasi-physics/GSD.jl\n- Created by: @amirabbasi-physics\n- Version: v0.1.0\n- Commit: 590f69df24ba7ad76602b6cc70299d7582dfbbab\n- Reviewed by: @amirabbasi-physics\n- Reference: https://github.com/amirabbasi-physics/GSD.jl/issues/1#issuecomment-3214956343\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n`````\n- Initial release of GSD.jl\n- Read/write GSD trajectories (positions, velocities, bonds, angles, …)\n- Provides HOOMD-style interface\n`````\n<!-- END RELEASE NOTES -->\n\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a835980db8b62a539644811ece7eee8ec259be2c76533cdb36a31b62269ba43b894ce03394f67d05a52dbb9b63ff06d37aedd5cb6201ab15a61eff356fc8f81a9aaeabcadde1cb9abb3a0e184c73216af081d077c0baf5f5962cc3232c2d62dab0b2049da41708e1d32647eb3e41c40829b95289265bb0fc91fc8b7d40e24300067700 -->",
  "package_name": "GSD",
  "closed_at": "2025-08-22T18:04:05Z",
  "title": "New package: GSD v0.1.0"
}