{
  "created_at": "2025-04-16T09:45:49Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 129184,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86nbn0t",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) are all met! ✅\n\nYour new package registration met all of the guidelines for auto-merging and is scheduled to be merged when the mandatory waiting period (3 days) has elapsed.\n\n## 3. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-04-16T09:51:55Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2809036077",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86nfXJ5",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Are you sure you want to tag this initial version as `v1.0.0`? If you are following [semantic versioning](https://semver.org), then the [TODO line in the README](https://github.com/crisbour/OpalKelly.jl?tab=readme-ov-file#todo)\r\n\r\n> Write documentation inline with code and generate docs webpage\r\n\r\nwould indicate that this package isn't quite ready yet for a stable release.\r\n\r\nIn the Julia ecosystem, we try to encourage the proper use of semantic versioning. As a general rule, versions `<v1.0` are for initial development, when the API of the package isn't nailed down yet, the package does not have a lot of dependents, and \"backwards compatibility\" is not a major concern. For an initial registration, that's usually the situation your package is in. Thus, an initial `v0.1` is usually the way to go. The bar for registering an initial `v0.1` is not very high. Basically, just\r\n\r\n* Must have a name that is appropriate for the scope of the package\r\n* Must have some non-trivial functionality (no \"placeholder\" packages)\r\n* Must have a README that explains the purpose of the package and gives a basic usage example (or a link to documentation that is sufficient to figure out how to get started)\r\n\r\nFor a version `v1.0`, you're saying that the package already has a stable API. That has some implications for what one would expect from that package. Personally, I tend to apply the following guidelines:\r\n\r\n* Must _define_ the stable API. That generally means _complete_ documentation.\r\n* Should have tests with reasonable coverage (on the order of 80%). Otherwise, there's no way to know if the package actually implements its API correctly, and no basis for figuring out whether a pull request is \"breaking\" or not, going forward.\r\n* Should somewhat reasonably fill the described scope of the package. No _major_ gaps in functionality.\r\n\r\nEven if you think your package is fairly polished already, I always recommend registering with an initial `v0.1` anyway. That way, you have a chance to find out whether there are any major flaws in the package once people start to use it. Once it has a few dependents and you really should start to worry about maintaining backwards compatibility, you can always make a `v1.0` release. That doesn't mean you absolutely have to make significant changes to the `v0.1` version. Just make sure that your package is fully documented as \"stable\" at that point, has good test coverage, and all the other things people would expect from a \"stable\" package.",
      "createdAt": "2025-04-16T15:52:48Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2810016377",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86np0Qg",
      "author": {
        "login": "crisbour"
      },
      "authorAssociation": "NONE",
      "body": "Hi @goerz. Thanks for your comments! I apologies for being eager to bump it to a stable release without fully understanding the implications. Since I was increasing the version monotonically as v0.x.0 and last one was v0.5.0, will just retag this as v0.6.0 to mark it as milestone for release to the General registry.\r\n\r\nI am not quite sure how to reissue the registration though. Should I make the changes and reissue a completely new registration for a new package, or is it possible to re-trigger this pipeline after the changes?",
      "createdAt": "2025-04-17T12:46:59Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2812757024",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86np41j",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "You just re-trigger the registration the same way you triggered this one. Usually, I comment `@JuliaRegistrator register` on the commit I want to tag, but if you used the web form, you’d just fill that out again.\r\n\r\nIn this case, because the version number changed, that will create a new PR, and we’ll close this one in favor of the new one. For other changes, it would update an existing PR.",
      "createdAt": "2025-04-17T12:55:22Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2812775779",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86sMggZ",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2025-05-18T12:23:51Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2888960025",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86tUXBA",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2025-05-25T12:23:59Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/129184#issuecomment-2907795520",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: OpalKelly\n- Repository: https://github.com/crisbour/OpalKelly.jl\n- Created by: @crisbour\n- Version: v1.0.0\n- Commit: 5090a186d000bc7e8a066d36aef7781663e319f0\n- Git reference: HEAD\n- Description: OpalKelly FrontPanel API in Julia\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n`````\nOpalKelly stub with extensions for FrontPanel API, already used in QuantiCam.jl project\n`````\n<!-- END RELEASE NOTES -->",
  "package_name": "OpalKelly",
  "closed_at": "2025-05-25T12:24:00Z",
  "title": "New package: OpalKelly v1.0.0"
}