{
  "violations": [
    {
      "excerpt": "not all letters are upper-case",
      "type": "all_caps"
    },
    {
      "excerpt": "name does not meet format requirements",
      "type": "naming_format"
    }
  ],
  "has_violations": true,
  "num_comments": 5,
  "package_author": "staticfloat",
  "decision": {
    "merged": true,
    "closed_by": null,
    "merged_by": "staticfloat",
    "time_to_decision_days": 0
  },
  "pr_number": 113624,
  "package_name": "macOSSDK_jll",
  "discussion": [
    {
      "influence": 1,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "Umm… did you self-merge your own PR? This seems highly irregular. Can you give some background on what happened here?",
      "stance": "unrelated"
    },
    {
      "influence": 4,
      "author": "staticfloat",
      "author_association": "MEMBER",
      "text": "JLLs don't follow the same rules as normal packages, for instance there's no 3 day waiting period for new packages.  Most JLLs, generated by [Yggdrasil](https://github.com/JuliaPackaging/Yggdrasil), are automatically merged 15 minutes after being opened here.  This is because the maintainers of Yggdrasil (which includes myself) are trusted to maintain the \"_jll\" namespace of Julia packages, and if something gets merged in Yggdrasil, it is automatically incorporated here without extra scrutiny.  Therefore, I merged this PR soon after opening it.\r\n\r\nThis JLL was generated via [BinaryBuilder2](https://github.com/JuliaPackaging/BinaryBuilder2.jl) and as such has [a dependency](https://github.com/JuliaPackaging/BinaryBuilder2.jl/tree/main/LazyJLLWrappers.jl) that doesn't pass the JLL auto-merge criteria (at least, until someone gets around to [merging this PR](https://github.com/JuliaRegistries/RegistryCI.jl/pull/571)).\r\n\r\n[I also did this for `Mingw_jll`](https://github.com/JuliaRegistries/General/pull/111897#issuecomment-2269923943), which had the exact same issue.  Getting these packages registered is very helpful for making forward progress on BinaryBuilder2.",
      "stance": "pro_merge"
    },
    {
      "influence": 2,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "Okay, thanks for the clarification! Since I don't have experience with JLLs I generally ignore anything related to that, or rather, I almost never see anything JLL-related pop up here. There's usually an entirely different process for JLL packages, right? Out of curiosity, why did this package show up in the new packages feed when other JLLs do not?\r\n\r\nI was just a little concerned about the self-merge, since that recently came up as a problem for a normal (non-JLL) package. For normal packages, I've advocated that nobody should manually merge registrations that they have any kind of stake in. That may not apply to the JLL namespace, though. If it's not a problem, then it's not a problem :-)",
      "stance": "neutral_merge"
    },
    {
      "influence": 1,
      "author": "staticfloat",
      "author_association": "MEMBER",
      "text": "> Out of curiosity, why did this package show up in the new packages feed when other JLLs do not?\r\n\r\nAh, you're talking about the `#new-packages-feed` on slack?  I wasn't aware of that channel, but my guess is that Logan has set that up to ignore JLL packages through some criterion that this PR does not satisfy, e.g. because the initiating user is not `@jlbuild`, perhaps.",
      "stance": "unrelated"
    }
  ],
  "wrapper_info": {
    "is_wrapper": true,
    "wrapped_library": null
  },
  "slack_mentioned": true,
  "justifications": [],
  "related_prs": []
}