{
  "violations": [],
  "has_violations": false,
  "num_comments": 5,
  "package_author": "pfitzseb",
  "decision": {
    "merged": false,
    "closed_by": "fredrikekre",
    "merged_by": null,
    "time_to_decision_days": 5
  },
  "pr_number": 4658,
  "package_name": "GFM",
  "discussion": [
    {
      "influence": 1,
      "author": "",
      "author_association": "NONE",
      "text": "Your `new package` pull request does not meet all of the guidelines for automatic merging.\n\nSpecifically, your pull request does not meet the following guidelines:\n\n- Name does not meet all of the following: starts with a capital letter, ASCII alphanumerics only, ends in lowercase\n- Name is not at least five characters long\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment.\n\n(If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.)\n\n---\nIt is important to note that if your pull request does not meet the guidelines for automatic merging, this does not mean that your pull request will never be merged. It just means that your pull request will require manual review by a human.\n\n> These guidelines are intended not as requirements for packages but as very conservative guidelines, which, if your new package or new version of a package meets them, it may be automatically merged.\n\n---\nOn a separate note, I see that you are registering a release with a version number of the form `v0.X.Y`.\n\nDoes your package have a stable public API? If so, then it's time for you to register version `v1.0.0` of your package. (This is not a requirement. It's just a recommendation.)\n\nIf your package does not yet have a stable public API, then of course you are not yet ready to release version `v1.0.0`.\n\n---\n[noblock]",
      "stance": "unrelated"
    },
    {
      "influence": 3,
      "author": "fredrikekre",
      "author_association": "MEMBER",
      "text": "GitHubMarkdown?",
      "stance": "neutral_merge"
    },
    {
      "influence": 1,
      "author": "pfitzseb",
      "author_association": "CONTRIBUTOR",
      "text": "https://github.com/JuliaRegistries/General/pull/4804",
      "stance": "unrelated"
    },
    {
      "influence": 2,
      "author": "fredrikekre",
      "author_association": "MEMBER",
      "text": "Was just a suggestion, up to you :)",
      "stance": "neutral_merge"
    },
    {
      "influence": 3,
      "author": "pfitzseb",
      "author_association": "CONTRIBUTOR",
      "text": "Well, I liked the suggestion ;)",
      "stance": "pro_merge"
    }
  ],
  "wrapper_info": {
    "is_wrapper": false,
    "wrapped_library": null
  },
  "slack_mentioned": false,
  "justifications": [
    "minimum_length_satisfied"
  ],
  "related_prs": [
    4804
  ]
}