{
  "created_at": "2021-04-12T10:50:01Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "giordano",
  "merged_at": null,
  "pr_number": 34082,
  "comments": [
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgxNzcxMTAxNA==",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an uppercase letter, ASCII alphanumerics only, not all letters are uppercase.\n- Name is not at least five characters long\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: FFTW, Images, Pipe\n- Package name similar to 14 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n  \n  1. Similar to H3. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.80 is at or below cutoff of 2.50.\n  2. Similar to GR. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.33 is at or below cutoff of 2.50.\n  3. Similar to MPI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to NPZ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to Z3. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to XPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to SPH. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to Tk. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GCP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to DSP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to GAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to HTTP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-04-12T10:54:46Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/34082#issuecomment-817711014",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgxNzc3NDQyNg==",
      "author": {
        "login": "giordano"
      },
      "authorAssociation": "MEMBER",
      "body": "Repo doesn't exist anymore, so I'm going to close this pull request.",
      "createdAt": "2021-04-12T12:36:41Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/34082#issuecomment-817774426",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: HP\n- Repository: https://github.com/rfhklwt/HP.jl\n- Created by: @rfhklwt\n- Version: v0.1.0\n- Commit: bcb418a6f81d3e37743f6c9359904f053d72e575\n- Git reference: HEAD\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n> A package for digital holographic image processing\n<!-- END RELEASE NOTES -->",
  "package_name": "HP",
  "closed_at": "2021-04-12T12:36:47Z",
  "title": "New package: HP v0.1.0"
}