{
  "violations": [
    {
      "excerpt": "name too short",
      "type": "too_short"
    }
  ],
  "has_violations": true,
  "num_comments": 4,
  "package_author": "araujoms",
  "decision": {
    "merged": true,
    "closed_by": null,
    "merged_by": "ericphanson",
    "time_to_decision_days": 3
  },
  "pr_number": 110011,
  "package_name": "Ket",
  "discussion": [
    {
      "influence": 3,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "I think `Ket` could be okay as a package name. However: `Ket` is also a very \"nice\" name, and at least in my book, such names should come with extra scrutiny: A package with a name like that should be one of the pre-eminent Julia packages in its domain. We should avoid registering high-profile names for packages that are likely to end up incomplete and unmaintained. My general criteria are that the package should be fairly full-featured and fully documented at the time of registration, and that the maintainer can make a long-term commitment. Generally, that means someone with a permanent position (or backing by, e.g., an academic PI that is committed to having multiple generations of PhD students/postdocs work on the package). Multiple maintainers and ownership by an organization (as opposed to a personal account) are also a big plus. Specifically for quantum frameworks, it is also good to be aware that this is not a small endeavor, and there are a number of established frameworks in the domain. Most notably, QuantumOptics.jl and more recently QuantumToolbox.jl, which is intended as a Julia translation of the very popular QuTiP (Python) package. How would Ket position itself in that existing space? Is it worth starting another package? These questions should also be answered in the README/documentation. It wouldn't be a bad idea to draft a \"statement of need\" like that required for a [JOSS submission](https://joss.readthedocs.io/en/latest/review_criteria.html).\r\n\r\n[noblock]",
      "stance": "neutral_merge"
    },
    {
      "influence": 4,
      "author": "araujoms",
      "author_association": "CONTRIBUTOR",
      "text": "I do have a permanent position in the University of Valladolid, and two of my collaborators also have permanent positions (@peterjbrown519 and @mtcq). We commit to maintaining the package long-term. In fact we started Ket precisely because the existing packages don't really cut it. QuantumInformation.jl would be the closest analogue, but it is buggy and the maintainers uninterested. OpenQuantumTools.jl, QuantumToolbox.jl, and QuantumOptics.jl are focused on quantum simulation, not quantum information. There's some overlap, but they only do a small fraction of what we need, and don't do it the way we need. For example, in quantum information one always need the functions `partial_trace` and `partial_transpose`. QuantumToolbox.jl, QuantumOptics.jl, and QuantumInformation.jl have them, but their implementation is incompatible with JuMP, so they're useless for us. I managed to fix the ones from OpenQuantumTools.jl, but still they are very slow and cannot handle the general case, so we lost patience and implemented our own. Still, our focus is on things they are not interested, such as our functions to produce MUBs and SIC-POVMs, which as far as I can see nobody else has, and (still unimplemented) numerical optimization techniques that we describe in our [review](https://arxiv.org/abs/2307.02551). The package is intended as an spiritual successor to the widely used MATLAB package [QETLAB](https://github.com/nathanieljohnston/QETLAB) (which I have contributed to).\r\n\r\nThe package is admittedly still very incomplete. I requested registration now because I've just submitted the first paper using it to the arXiv, and I don't want to bother my readers asking it to install it manually. The second paper will follow next week, and @sebastiendesignolle has a third one in the works.\r\n\r\nI think I must add that the few functions that we have already implemented are the best ones available. \r\n\r\n[noblock]",
      "stance": "pro_merge"
    },
    {
      "influence": 5,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "[noblock] Based on that explanation, I would have no objections to this package being registered under the name `Ket`. I don't have merge permissions, though, so ultimately it'll come down to convincing at least one registry maintainer to merge it manually. If nobody else voices any concerns, you can wait the three-day period, and then ping the `#pkg-registration` channel on Slack again and ask for a merge.",
      "stance": "pro_merge"
    }
  ],
  "wrapper_info": {
    "is_wrapper": false,
    "wrapped_library": null
  },
  "slack_mentioned": true,
  "justifications": [
    "minimum_length_satisfied"
  ],
  "related_prs": []
}