{
  "created_at": "2025-01-05T02:49:11Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 122417,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86ZRbLT",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Repo URL does not end with /name.jl.git, where name is the package name\n- Package name similar to 18 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to EDF. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.08 is at or below cutoff of 2.50.\n  2. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.68 is at or below cutoff of 2.50.\n  3. Similar to FDM. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.94 is at or below cutoff of 2.50.\n  4. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to BDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to ECC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to GDAL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to ODE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to BED. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to XPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to XDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to MD5. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to JDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to ADI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to SDPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to ERFA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to CUDA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to VIDA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-01-05T03:01:29Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/122417#issuecomment-2571481811",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86ZRgGb",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closing in favor of https://github.com/JuliaRegistries/General/pull/122422",
      "createdAt": "2025-01-05T04:58:56Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/122417#issuecomment-2571501979",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: EDA\n- Repository: https://github.com/notGiGi/ExploratoryDataAnalysis\n- Created by: @notGiGi\n- Version: v1.0.0\n- Commit: df15d8d61cabab1d94c069aeed49f44470a64f6b\n- Reviewed by: @notGiGi\n- Reference: https://github.com/notGiGi/ExploratoryDataAnalysis/issues/8\n- Description: The EDA Pkg simplifies exploratory data analysis by offering tools for data visualization, cleaning, and preparation. It includes functions for handling missing values, detecting outliers, analyzing correlations, and generating insightful visualizations. Perfect for understanding and preparing datasets for advanced analysis or modeling.\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n`````\nEDA.jl\r\n\r\n## Version 0.1.0\r\n\r\n### Highlights\r\n- Initial release of **EDA.jl**, a powerful and comprehensive Julia package for exploratory data analysis.\r\n\r\n### Features\r\n#### Data Cleaning and Handling\r\n- `threshold`: Remove columns with missing data exceeding a user-defined percentage.\r\n- `outlierswithiqr`: Detect outliers using the Interquartile Range (IQR) method.\r\n- `outlierhandle`: Handle outliers with configurable options for removal.\r\n\r\n#### Data Exploration\r\n- `visualize_data`: Preview the first `n` rows of a dataset.\r\n- `dataType`: Analyze and display data types for all columns.\r\n- `correlation`: Compute correlation matrices for numeric columns.\r\n- `heat`: Generate heatmaps of correlation matrices for easy interpretation.\r\n\r\n#### Visualization\r\n- `correlation_network`: Create an interactive graph of correlations between variables.\r\n- Real vs. predicted plots for regression analysis.\r\n\r\n#### Statistical Analysis\r\n- `linearregression`: Fit linear regression models with detailed output of coefficients and predictions.\r\n\r\n#### Efficiency\r\n- All functionalities are encapsulated in the `EDALoader` structure, allowing for efficient data manipulation with built-in caching.\r\n\r\n### Improvements and Fixes\r\n- Optimized correlation and visualization functions to handle missing data gracefully.\r\n- Added error handling and user-friendly messages for all major functions.\r\n- Improved plotting aesthetics for enhanced data visualization.\r\n\r\n### Planned Features for Future Releases\r\n- Advanced time-series analysis tools:\r\n  - Seasonal decomposition.\r\n  - Trend detection.\r\n  - Forecasting models (ARIMA, Prophet, etc.).\r\n- Integration with PlotlyJS for interactive visualizations.\r\n- Machine learning integration with Julia ML frameworks.\r\n\r\n### Known Issues\r\n- Large datasets may experience performance degradation in some visualization functions. Optimization is planned in upcoming versions.\r\n\r\n### How to Upgrade\r\n1. Open Julia's REPL.\r\n2. Run the following commands:\r\n   ```julia\r\n   using Pkg\r\n   Pkg.update(\"EDA\")\n`````\n<!-- END RELEASE NOTES -->\n\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a8359855ff64bf7a905a7e1fc22324a0814bcc0e7d59a2184ab0730fbebbea73bfc069efa9d3bd55828a29698130da6cd3e859a96e516f556c01c819626a7ee15c3422fec5dc3bb8578d939f16c533fa94e5d8046bf24ee6c45f2017517d0243a3b4fc4a916a13669aa7fd6385b4ec7280a1862367d601b121b6f596e17aadab2e4c5e -->",
  "package_name": "EDA",
  "closed_at": "2025-01-05T04:58:56Z",
  "title": "New package: EDA v1.0.0"
}