{
  "created_at": "2022-09-16T20:30:37Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "giordano",
  "merged_at": null,
  "pr_number": 68432,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85KfkEu",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: Conda, PyCall\n- I was not able to load the package (i.e. `import ESA` failed). See the CI logs for details.\n- Package name similar to 19 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.45 is at or below cutoff of 2.50.\n  2. Similar to ECC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to QSM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to DSP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to EDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to XPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to SEAL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to AES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to NES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to ERFA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to COESA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2022-09-16T20:35:21Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/68432#issuecomment-1249788206",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85KgjCd",
      "author": {
        "login": "giordano"
      },
      "authorAssociation": "MEMBER",
      "body": "Presumably superseded by #68433 ",
      "createdAt": "2022-09-17T10:32:59Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/68432#issuecomment-1250046109",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: ESA\n- Repository: https://github.com/mzy2240/ESA.jl\n- Created by: @mzy2240\n- Version: v0.1.0\n- Commit: 88f01e729a44ac99dd7b16dc7967f328b58938ab\n- Reviewed by: @mzy2240\n- Reference: https://github.com/mzy2240/ESA.jl/issues/1\n- Description: Julia interface for Easy SimAuto(ESA) and PowerWorld Simulator\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a83598e3d5d8a920d0a7f85f26fb51c64ed7439804727bf54972576e732809e0df1c2c2ef81e72325b88a2241a0d101af9976c96ac0c0e5563c3dccbd1f804b74f74f1375d7c217beda1f54ae590ec71cdb6d41a052312fdfb0b292a6f7cdb5394f87d49fe0be7f5b57d96a8159065fcaf1b92 -->",
  "package_name": "ESA",
  "closed_at": "2022-09-17T10:32:59Z",
  "title": "New package: ESA v0.1.0"
}