{
  "created_at": "2024-06-23T23:29:25Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 109631,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86CQfGD",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 24 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to LNR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  2. Similar to GAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to Lux. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to LKH. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to ROS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to SCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to AWS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to RAI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to BAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to XAM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to WCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to NES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to AES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to WAV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to MAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to CAOS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to GAMS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to LITS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to FLAC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to JWAS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to GLNS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to BLIS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment. \n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2024-06-23T23:34:04Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/109631#issuecomment-2185359747",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86CWEVU",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closing in favor of https://github.com/JuliaRegistries/General/pull/109635",
      "createdAt": "2024-06-24T15:16:49Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/109631#issuecomment-2186822996",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: LAS\n- Repository: https://github.com/fugro-oss/LAS.jl\n- Created by: @BenCurran98\n- Version: v0.1.0\n- Commit: 9fee1a4c16f246c9460b0943f598832b6198e0df\n- Reviewed by: @BenCurran98\n- Reference: https://github.com/fugro-oss/LAS.jl/commit/9fee1a4c16f246c9460b0943f598832b6198e0df#commitcomment-143441446\n- Description: A Julia package for reading and writing LAS data\n<!-- bf0c69308befbd3ccf2cc956ac8a46712550b79fc9bfb5e4edf8f833f05f4c18b06eddad8845b45beb9f45c2b8020dd6287e527422ba53719aece39d7c179b070665320cba1f876b752bf8705b6a6b2a005f2a5afebc49acb08dd4b4bb5b419deafc8d67f2c19400df8f6ba9710a1b1db630f945b10f50f0c193f8203b44558dafe3a1a9977dd2f575684ce8477aefd62da71f344dca688c410fa39c9643ac37fade292be97417e4f634039c005fd037aa6be8ea66da5b5598de35e2414cdea68b7225e2e4dc3aa9778c38adab9db53ae37592ade953fcd063c2315769dc96ae -->",
  "package_name": "LAS",
  "closed_at": "2024-06-24T15:18:44Z",
  "title": "New package: LAS v0.1.0"
}