{
  "violations": [
    {
      "excerpt": "not all letters are upper-case",
      "type": "all_caps"
    },
    {
      "excerpt": "name does not meet format requirements",
      "type": "naming_format"
    }
  ],
  "has_violations": true,
  "num_comments": 11,
  "package_author": "emmt",
  "decision": {
    "merged": true,
    "closed_by": null,
    "merged_by": "fredrikekre",
    "time_to_decision_days": 10
  },
  "pr_number": 125263,
  "package_name": "AMORS",
  "discussion": [
    {
      "influence": 3,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "`AMORS` is in uppercase letters because it is the acronym for \"**A**lternated **M**inimization using **O**ptimal **R**e**S**caling\" the name of the published method (see [References](https://github.com/emmt/AMORS.jl?tab=readme-ov-file#references)).",
      "stance": "pro_merge"
    },
    {
      "influence": 4,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "Unfortunately, acronyms are heavily frowned upon in the Julia community. Personally, I don't have issues with pronounceable acronyms like `AMORS`. I would merge this (but don't have merge permissions).\r\n\r\nYou will have to go on Slack to convince a full registry maintainer to merge this manually. There seems to be less and less appetite for acronyms, though, so it may require repeated pings.\r\n\r\nBesides the pronounceability of `AMORS` (which makes it a perfectly acceptable [\"less systematic name\"](https://pkgdocs.julialang.org/dev/creating-packages/#Package-naming-rules) in my book), good arguments might be that there is no very obvious alternative package name that would fit the usual \"long and descriptive\" mold, and that you could get around the automatic check by varying the spelling to `Amors` or `AMORs`. It seems silly to me to prevent the use of a package name solely based on capitalization.",
      "stance": "pro_merge"
    },
    {
      "influence": 2,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "@goerz Thank you for your reply.\r\n\r\nI could rename the package as `Amors` unfortunately it fails the `AutoMerge` distance test. I have checked that I can use `BilinearModelOptimalRescaling` which is a bit long but which conveys all necessary information and add `AMORS` as a topic...\r\n\r\nHow do I cleanly cancel a registration?",
      "stance": "neutral_merge"
    },
    {
      "influence": 4,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "> I could rename the package as Amors unfortunately it fails the AutoMerge distance test.\r\n\r\nI can override that check. Usually, it's a false positive. What package does `Amors` conflict with? I thought that the name similarity check was case-insensitive, so it's a bit surprising that `AMORS` doesn't trigger it as well.\r\n\r\nIn any case, I would make a strong case for `AMORS` being better than `Amors`. I dislike the idea of changing the capitalization of an acronym just to make the bot happy. By doing that, you lose the connection to what just _is_ an acronym. Personally, I think the choice between \"merge `AMORS` manually\" and \"let the renamed `Amors` auto-merge\" is a no-brainer, the former being hugely preferable to the latter from a community perspective.\r\n\r\n> I have checked that I can use `BilinearModelOptimalRescaling` which is a bit long but which conveys all necessary information\r\n\r\nThat's definitely an option that would side-step the issue. \"Long\" is generally encouraged, so that's not a problem. Plus, it's always possible to use it as `import BilinearModelOptimalRescaling as AMORS`. What you might lose is name recognition. I don't know how widely known the acronym AMORS is, and whether that's a significant concern.\r\n\r\nMy recommendation would be – unless you have a preference for `BilinearModelOptimalRescaling` – to wait to the end of the three-day period, and then ask for `AMORS` to be merged manually.\r\n\r\n> How do I cleanly cancel a registration?\r\n\r\nUnmerged registrations are automatically closed after 30 days of inactivity. Or, I can close a PR manually, which I usually do if there's a replacement, e.g., a new package name (\"Closing in favor of …\")\r\n\r\n",
      "stance": "pro_merge"
    },
    {
      "influence": 3,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "Here is the result of the metric:\r\n\r\n```julia\r\njulia> using RegistryCI, RegistryCI.AutoMerge\r\n\r\njulia> all_pkg_names = AutoMerge.get_all_non_jll_package_names(joinpath(DEPOT_PATH[1], \"registries\", \"General\"));\r\n\r\njulia> AutoMerge.meets_distance_check(\"AMORS\", all_pkg_names)\r\n(true, \"\")\r\n\r\njulia> AutoMerge.meets_distance_check(\"Amors\", all_pkg_names)\r\n(false, \"Package name similar to 4 existing packages.\\n  1. Similar to Amaru. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.05 is at or below cutoff of 2.50.\\n  2. Similar to Kmers. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.44 is at or below cutoff of 2.50.\\n  3. Similar to Attrs. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\\n  4. Similar to Actors. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\")\r\n```\r\n\r\nso it seems that the check is case sensitive.\r\n\r\n> My recommendation would be – unless you have a preference for `BilinearModelOptimalRescaling` – to wait to the end of the three-day period, and then ask for `AMORS` to be merged manually.\r\n> \r\n\r\nI think I will follow your advice. Indeed I strongly prefer `AMORS` to be the name of the package as it is also the name of the published method. I am ready to wait a few more days for a \"manual merge\".\r\n\r\nMany thanks for your help.\r\n\r\n\r\n",
      "stance": "pro_merge"
    },
    {
      "influence": 3,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "I [pinged the Slack](https://julialang.slack.com/archives/C6M4DQA5P/p1740320245866529) on this on your behalf",
      "stance": "pro_merge"
    },
    {
      "influence": 2,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "> My recommendation would be – unless you have a preference for `BilinearModelOptimalRescaling` – to wait to the end of the three-day period, and then ask for `AMORS` to be merged manually.\r\n> \r\n\r\nHow do I do this? I tought I just have to wait but it does not seem to be the case...\r\n\r\n",
      "stance": "neutral_merge"
    },
    {
      "influence": 2,
      "author": "goerz",
      "author_association": "MEMBER",
      "text": "Well, you have to advocate for the package on Slack. One of the registry maintainers has to be convinced to merge the package manually. Lately, it seems that requests are getting ignored at first try. So, pinging the channel every few days until someone merges it (or objects to it strongly enough to give a hard \"no\") is probably the only thing to do.",
      "stance": "neutral_merge"
    },
    {
      "influence": 1,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "Ok I see, I am quite new to this sort of things... I've just find how to create a Slack account and connect to it.",
      "stance": "unrelated"
    },
    {
      "influence": 5,
      "author": "emmt",
      "author_association": "CONTRIBUTOR",
      "text": "I've just seen that AMORS is now in the General registry. Many thanks for your help!",
      "stance": "pro_merge"
    }
  ],
  "wrapper_info": {
    "is_wrapper": false,
    "wrapped_library": null
  },
  "slack_mentioned": true,
  "justifications": [],
  "related_prs": []
}