{
  "created_at": "2021-05-06T05:31:14Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "giordano",
  "merged_at": null,
  "pr_number": 36177,
  "comments": [
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgzMzIzODc3OA==",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an uppercase letter, ASCII alphanumerics only, not all letters are uppercase.\n- Name is not at least five characters long\n- Package name similar to 19 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n  \n  1. Similar to AES. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.62 is at or below cutoff of 2.50.\n  2. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.97 is at or below cutoff of 2.50.\n  3. Similar to AWS. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.39 is at or below cutoff of 2.50.\n  4. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to CRC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to ADI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to ECC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to SMC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to BBI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to XCB. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to VQC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to Amb. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to Ant. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to BAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to ODBC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to EBIC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to JDBC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to GpABC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to Cbc. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-05-06T05:34:33Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/36177#issuecomment-833238778",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgzMzI0ODI1NQ==",
      "author": {
        "login": "macd"
      },
      "authorAssociation": "NONE",
      "body": "I'd like to leave the name as ABC and have this manually merged, since this wraps the Berkeley project ABC which is a logic synthesis and verification program.",
      "createdAt": "2021-05-06T05:56:58Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/36177#issuecomment-833248255",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgzNDYzMjU1Nw==",
      "author": {
        "login": "macd"
      },
      "authorAssociation": "NONE",
      "body": "Closing the PR to rename pkg to BerkeleyABC",
      "createdAt": "2021-05-07T17:15:34Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/36177#issuecomment-834632557",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgzNDYzNDgwNQ==",
      "author": {
        "login": "macd"
      },
      "authorAssociation": "NONE",
      "body": "Close pull request",
      "createdAt": "2021-05-07T17:19:29Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/36177#issuecomment-834634805",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: ABC\n- Repository: https://github.com/macd/ABC.jl\n- Created by: @macd\n- Version: v1.1.0\n- Commit: 76ae10c23393106d03d7be63ffa361963629ea18\n- Git reference: HEAD\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n> Convenience wrapper around ABC_jll for Berkeley ABC: Logic Synthesis and Verification\n<!-- END RELEASE NOTES -->",
  "package_name": "ABC",
  "closed_at": "2021-05-07T18:17:51Z",
  "title": "New package: ABC v1.1.0"
}