{
  "created_at": "2025-06-30T09:58:24Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 133925,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86z65Fg",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 32 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to AES. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.09 is at or below cutoff of 2.50.\n  2. Similar to WCS. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.45 is at or below cutoff of 2.50.\n  3. Similar to SCS. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.86 is at or below cutoff of 2.50.\n  4. Similar to AWS. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.33 is at or below cutoff of 2.50.\n  5. Similar to ROS. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.99 is at or below cutoff of 2.50.\n  6. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.09 is at or below cutoff of 2.50.\n  7. Similar to NES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to XCB. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to ADI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to ECC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to GCP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to UCX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to uCSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to Ant. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to Amb. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to Air. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to TCX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to ACME. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to CAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to ECOS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to AEMS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to MCTS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to CDCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to AKNS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  28. Similar to DACE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  29. Similar to CAOS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  30. Similar to JACC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  31. Similar to GAMS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  32. Similar to NATS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-06-30T10:06:06Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/133925#issuecomment-3018559840",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86z7ZkS",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "I would not recommend `AmCommSurvey`. Long descriptive package names are strongly encouraged by the guidelines, and I don’t think `AmericanCommunitySurvey` is too long.",
      "createdAt": "2025-06-30T10:52:25Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/133925#issuecomment-3018692882",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86z7bbL",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "`CensusACS` would also be a good option, though… there _is_ value in the recognizability of an acronym if it is given some context ",
      "createdAt": "2025-06-30T10:55:05Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 1
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/133925#issuecomment-3018700491",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q860Xf5S",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closed in favor of https://github.com/JuliaRegistries/General/pull/134035",
      "createdAt": "2025-07-02T01:39:04Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/133925#issuecomment-3026058834",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: ACS\n- Repository: https://github.com/technocrat/ACS.jl\n- Created by: @technocrat\n- Version: v0.1.0\n- Commit: 4b46200b6c8a2e87bbf4a049574e9da363acf492\n- Git reference: HEAD\n- Description: Julia functions to download US Census American Community Survey data\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n`````\nACS.jl provides a simple and robust interface to access American Community Survey data through the Census Bureau's API. The package supports:\n\nData retrieval from 1-year, 3-year, and 5-year ACS estimates\nVarious geographic levels (state, county, tract, block group)\nAutomatic handling of state FIPS codes\nRobust error handling and retries\nDataFrame output format\nSeparate functions for estimates and margin of error values\nFunction to fetch names of Census variables\nConvenience functions to download 2023 state and county boundary shapefiles at 500k resolution.\nIt is a port of portions of the R tidycensus package\n`````\n<!-- END RELEASE NOTES -->",
  "package_name": "ACS",
  "closed_at": "2025-06-30T10:52:25Z",
  "title": "New package: ACS v0.1.0"
}