{
  "created_at": "2023-10-09T14:03:44Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 93079,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85ofgW0",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: Measurements\n- Package name similar to 32 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to AMD. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.37 is at or below cutoff of 2.50.\n  2. Similar to ASE. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.11 is at or below cutoff of 2.50.\n  3. Similar to ACME. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  4. Similar to FAME. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  5. Similar to Amb. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  6. Similar to AWS. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.07 is at or below cutoff of 2.50.\n  7. Similar to NMF. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.13 is at or below cutoff of 2.50.\n  8. Similar to SMC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to XML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to KML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to QML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to ODE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to AES. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to Ant. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to GMT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to ADI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to SMM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to FMI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to AMGX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to ZMQ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to NMEA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to MAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to XAM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to VMEC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to Air. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to HAML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to AEMS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  28. Similar to TMLE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  29. Similar to GAMS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  30. Similar to YAML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  31. Similar to RoME. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  32. Similar to ADCME. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [Julia Slack](https://julialang.org/slack/) to ask for help. Include a link to this pull request.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment. You can edit blocking comments, adding `[noblock]` to them in order to unblock auto-merging.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2023-10-09T14:10:13Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1753089460",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85ooPcd",
      "author": {
        "login": "lgoettgens"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "I think this package's name contradicts the first naming rule \"1. Avoid jargon. In particular, avoid acronyms unless there is minimal possibility of confusion.\". It would be great if you could change the name to something more descriptive. Unfortunately, I could not find in your docs what \"AME\" is an abbreviation for, and so I am not able to give some suggestions.",
      "createdAt": "2023-10-10T12:58:39Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1755379485",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85ooZzU",
      "author": {
        "login": "0382"
      },
      "authorAssociation": "NONE",
      "body": "I understand the problems, and I will change the name of the package. But I don't know what I should do? Close this pull-request and make a new one? It seems I cannot close this pull-request.",
      "createdAt": "2023-10-10T13:23:09Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1755421908",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85oobFq",
      "author": {
        "login": "lgoettgens"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Just rename your package and re-trigger registration. This will the create a new PR to the registry.\r\nThis PR can just be abandoned. Due to our comments, it will no longer be merged automatically. Instead, CI will close it in about a month. ",
      "createdAt": "2023-10-10T13:26:13Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1755427178",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85oob45",
      "author": {
        "login": "lgoettgens"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Maybe something like \"AtomicMassEvaluation\" (if that's the long form of the abbreviation. I just found that in one of the links in your README). ",
      "createdAt": "2023-10-10T13:28:10Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1755430457",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85oocPh",
      "author": {
        "login": "0382"
      },
      "authorAssociation": "NONE",
      "body": "Ok, thank you very much.",
      "createdAt": "2023-10-10T13:29:00Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1755431905",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85o53AF",
      "author": {
        "login": "lgoettgens"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This is superseded by https://github.com/JuliaRegistries/General/pull/93281. ",
      "createdAt": "2023-10-12T16:53:49Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1759997957",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85rtlOt",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2023-11-12T12:22:43Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1807111085",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85sWgUS",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2023-11-19T12:23:08Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/93079#issuecomment-1817838866",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: AME\n- Repository: https://github.com/0382/AME.jl\n- Created by: @0382\n- Version: v0.0.1\n- Commit: e2c3cbbea566652b4d4fd111cf7e6607bfbb3105\n- Reviewed by: @0382\n- Reference: https://github.com/0382/AME.jl/commit/e2c3cbbea566652b4d4fd111cf7e6607bfbb3105#commitcomment-129521695\n- Description: Some data set from Atomic Mass Data Center.\n<!-- bf0c69308befbd3ccf2cc956ac8a46712550b79fc9bfb5e4edf8f833f05f4c18b06eddad8845b45beb9f45c2b8020dd6feed950610cb865bf4c52f08988bfc8ad6570f4b107e7df5d03eb259a51cc4d1516bb55b79b136c802f8a3f89900ed890786bd9aa4f4f95ada87df2ffaace1df48d043937f5b1666a5eb9ab114500f970114f387f1b95e947736e487b6de2518ec40a6825d6e74753ca2a58f6522cd17f8ba2e2875283345fcfe128f9ed686193ff43f53f699bfb9dff5448d8d07f12ee7b36d776a303392123318a485cc45ed -->",
  "package_name": "AME",
  "closed_at": "2023-11-19T12:23:09Z",
  "title": "New package: AME v0.0.1"
}