{
  "created_at": "2022-06-03T08:41:41Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "giordano",
  "merged_at": null,
  "pr_number": 61632,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85ESqHT",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Repo URL does not end with /name.jl.git, where name is the package name\n- There is no compat entry for `julia`.\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: CodecZlib, Distributions, Octavian\n- Package name similar to 13 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to QML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  2. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to ITK. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to MKL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to QSM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to QOI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to KML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to XML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to Tk. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2022-06-03T08:47:09Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/61632#issuecomment-1145741779",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85ESxU2",
      "author": {
        "login": "xijiang"
      },
      "authorAssociation": "NONE",
      "body": "QTL is the acronym for Quantitative Trait Loci. This is a cornerstone of breeding and genetics. Many related functions will be included in this package. If the name is now unique in the registry, and possible, I prefer this package name. \r\n\r\nAlso,\r\n- I just name the git repo to QTL.jl\r\n- I also used qtl as my pen name for hundreds of readers.\r\n\r\nRegards,",
      "createdAt": "2022-06-03T09:20:49Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/61632#issuecomment-1145771318",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85EVIr1",
      "author": {
        "login": "giordano"
      },
      "authorAssociation": "MEMBER",
      "body": "Presumably superseded by  #61644",
      "createdAt": "2022-06-03T21:55:22Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/61632#issuecomment-1146391285",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: QTL\n- Repository: https://github.com/xijiang/QTL\n- Created by: @xijiang\n- Version: v0.1.4\n- Commit: 965e0bcf0cc359d279bf129853bb70d57017a6e8\n- Git reference: HEAD\n- Description: About quantitative genetics\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n> This package contains many routines for Breeding and Genetics.\n<!-- END RELEASE NOTES -->",
  "package_name": "QTL",
  "closed_at": "2022-06-03T21:55:22Z",
  "title": "New package: QTL v0.1.4"
}