{
  "violations": [],
  "has_violations": false,
  "num_comments": 8,
  "package_author": "ThummeTo",
  "decision": {
    "merged": true,
    "closed_by": null,
    "merged_by": "ericphanson",
    "time_to_decision_days": 15
  },
  "pr_number": 37533,
  "package_name": "FMI",
  "discussion": [
    {
      "influence": 3,
      "author": "ThummeTo",
      "author_association": "NONE",
      "text": "[noblock]\r\n\r\nDear Julia-Registrator-Team,\r\n\r\nI read the guidelines for Julia Package Naming.\r\n\r\nI understand, that acronyms should be avoided according to Guideline#1, but \"FunctionalMockUpInterface\" would be a very long package name and the acronym \"FMI\" is straight forward translated into Functional Mock-up Interface, there are no other meanings that would make the acronym misleading. \r\n\r\nFurther, according to Guideline#6, wrapper-packages should be named after the parent library. This is a wrapper package and the parent library is named \"FMI\".\r\n\r\nIs it possible to use the library name \"FMI.jl\" ?\r\n\r\nThanks in advance!",
      "stance": "pro_merge"
    },
    {
      "influence": 3,
      "author": "ericphanson",
      "author_association": "MEMBER",
      "text": "> I understand, that acronyms should be avoided according to Guideline#1, but \"FunctionalMockUpInterface\" would be a very long package name and the acronym \"FMI\" is straight forward translated into Functional Mock-up Interface, there are no other meanings that would make the acronym misleading.\r\n\r\nI think there are! Googling gives me https://acronyms.thefreedictionary.com/FMI and https://www.allacronyms.com/FMI with lists of other things it could mean. Not all of those seem likely as Julia packages, but some of them do.\r\n\r\n> Further, according to Guideline#6, wrapper-packages should be named after the parent library. This is a wrapper package and the parent library is named \"FMI\".\r\n\r\nIs this the parent library? https://github.com/modelon-community/fmi-library (I couldn't find it linked from the repo). If so, there they write \"FMI Library (FMIL) is a software package...\" which makes me think fmi-library or FMIL is the name of the parent package, not FMI.\r\n\r\nIn my opinion, we really do not need more 3 letter package names-- there are not that many possible ones, after all.\r\n\r\nedit: but https://github.com/JuliaRegistries/General/pull/37152 would count as very recent precedent 🙂 .\r\n\r\n[noblock]",
      "stance": "anti_merge"
    },
    {
      "influence": 3,
      "author": "ThummeTo",
      "author_association": "NONE",
      "text": "Thanks for your reply!\r\n\r\n> Is this the parent library? https://github.com/modelon-community/fmi-library (I couldn't find it linked from the repo). If so, there they write \"FMI Library (FMIL) is a software package...\" which makes me think fmi-library or FMIL is the name of the parent package, not FMI.\r\n\r\nFMI is more like a standard (see: https://fmi-standard.org/). \"fmi-library\" is a C-frontend to use FMUs (Functional Mock-Up Units) inside a C-Application. We didn't wrap fmi-library, we provide the possibility to handle FMUs (which are technically zip-Archives with a *.DLL or *.SO inside) directly in Julia (using ccalls), so there is nothing like a parent library, more like a parent standard (named the FMI standard).\r\n\r\nFurther we are working on two library extensions and a longer name would lead to ridiculous long library names. \r\n\r\nAnd yap, https://github.com/JuliaRegistries/General/pull/37152 seems a VERY similar and recent precedent.\r\n\r\nFinally, there are similar libraries with similar features for other programming languages, like \"FMPy\" and \"PyFMI\" in Pyhton, so \"FMI.jl\" seems a pretty straight forward name for the Julia-pendant.\r\n\r\n[noblock]",
      "stance": "pro_merge"
    },
    {
      "influence": 4,
      "author": "ChrisRackauckas",
      "author_association": "MEMBER",
      "text": "I agree we should be careful about the usage of the 3 letter names. But one of our policies is that wrapper libraries match the name of the library being wrapped. In this case, FMI is a standard for the FMU binaries, and FMI.jl is the implementation of that wrapper interface. It's very analogous to the case of Sundials.jl being a wrapper to SUNDIALS, or Arrow.jl being the implementation of the Arrow interface. While in this case the binaries which satisfy this interface can change around, it's still an interface implementation or binary wrappers so according to our rules and practices this would be acceptable.\r\n\r\nThat said, `FunctionalMockUpInterface` isn't a bad name in terms of discoverability.",
      "stance": "pro_merge"
    },
    {
      "influence": 3,
      "author": "ThummeTo",
      "author_association": "NONE",
      "text": "Thanks for your replys!\r\n\r\nI am struggling, we want to match the Julia Naming Guidelines (we don't match #1, but we do match #6, which is a contradiction), on the other hand we want to continue naming conventions, that are common in the FMI-world. Two worlds coming together.\r\n\r\nThere is a list with available FMI-tools (and names), many are programs that support FMI, but there are also wrapper libraries like ours included: [FMI Tools](https://fmi-standard.org/tools/)\r\n\r\nLibrarys that do something similar are:\r\n- FMPy, PyFMI (Python)\r\n- FMI4cpp (CPP)\r\n- FMI4j, JavaFMI, JFMI (Java)\r\n\r\nThe list does not contain a single \"FunctionalMockUpInterface\" or similar named library. \r\nNames like \"fmi-standard\" are prohibited, because they imply that it's an offical thing from the Modelica Association (the parents of FMI).\r\n\r\nMapped to our case, possible alternatives for names would be:\r\n- FMIJulia.jl (doubling)\r\n- JuliaFMI.jl (already exists, doubling)\r\n- FMI4Julia.jl (doubling)\r\n\r\nOr straight forward: FMI.jl\r\n\r\nIf there are other opinions or ideas, I am definitely **open for a renaming**, but please keep into account both communities: Julia _and_ FMI.\r\n\r\nUsers, that are fimilar with FMI (and know the corresponding libraries) should feel like it's only a small step to try out the Julia-way: \"Using PyFMI and Python? Using JFMI and Java? Why not try FMI.jl and Julia!\"\r\n\r\nThanks in advance.",
      "stance": "pro_merge"
    },
    {
      "influence": 5,
      "author": "ericphanson",
      "author_association": "MEMBER",
      "text": "Ok, let's do it",
      "stance": "pro_merge"
    },
    {
      "influence": 1,
      "author": "ThummeTo",
      "author_association": "NONE",
      "text": "Thank you very much!",
      "stance": "unrelated"
    }
  ],
  "wrapper_info": {
    "is_wrapper": true,
    "wrapped_library": null
  },
  "slack_mentioned": false,
  "justifications": [
    "minimum_length_satisfied"
  ],
  "related_prs": []
}