{
  "created_at": "2021-08-23T14:14:22Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 43380,
  "comments": [
    {
      "id": "IC_kwDOBhF1q8413yM0",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Lowercase package name dmrjulia contains the string \"julia\".\n- There is no compat entry for `julia`.\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-08-23T14:17:33Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/43380#issuecomment-903815988",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q84134os",
      "author": {
        "login": "bakerte"
      },
      "authorAssociation": "NONE",
      "body": "Hello, I had originally authored this package in 2016 and posted it online in 2017 or so.  I have used the name \"DMRjulia\" in several publications and other advertising documents.  I decided to register it in the official package registry after some requests from collaborators.\r\n\r\nThe name is a play on the action of contracting similar indices in tensor networks and the bulk of the funding for this project came from a French-speaking institution--Institut quantique--in Québec, Canada.  The \"G\" and \"J\" in French are reversed from English, making them a frequently confusing letter to communicate, so contracting over the \"G\" in the method name (DMRG) and the \"J\" in Julia was well received by people.\r\n\r\nI also noticed that the \"MLJ\" package contains a similar naming convention and thought it was appropriate here since this is the only tensor network package without other dependencies that is entirely written in Julia. The name is also influenced by several Python based packages that have \"Python\" in their name. This project will be used by several students to learn tensor networks and represents a widely praised implementation of tensor networks, one that is easy to use and should be popular with several groups.",
      "createdAt": "2021-08-23T14:48:36Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/43380#issuecomment-903842348",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q843LkYp",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2021-09-23T12:46:29Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/43380#issuecomment-925779497",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q843kC1P",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2021-10-01T12:46:13Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/43380#issuecomment-932195663",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: DMRjulia\n- Repository: https://github.com/bakerte/DMRjulia.jl\n- Created by: @bakerte\n- Version: v0.8.0\n- Commit: a79dd64846e467f18ffb8acc8cc1d929b29ae7b4\n- Git reference: HEAD",
  "package_name": "DMRjulia",
  "closed_at": "2021-10-01T12:46:13Z",
  "title": "New package: DMRjulia v0.8.0"
}