{
  "created_at": "2023-08-19T19:32:29Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 89938,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85kcHUs",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 25 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.82 is at or below cutoff of 2.50.\n  2. Similar to Tau. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to TCX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to ECC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to Tar. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to VQC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to SCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to CRC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to TSML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to SMC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to DSP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to TSne. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to Try. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to WCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to Tk. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to QSM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to TSVD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to RSCG. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to STAC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [Julia Slack](https://julialang.org/slack/) to ask for help. Include a link to this pull request.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment. You can edit blocking comments, adding `[noblock]` to them in order to unblock auto-merging.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2023-08-19T19:41:05Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1685091628",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85kc76o",
      "author": {
        "login": "nilshg"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "TSC is really not a great name - google says it means typescript compiler or tuberculosis sclerosis complex.\n\nShort acronyms aren't always disallowed but there must be very good reasons to get them into General (say the name of a file format like CSV, json, or some published method that is unambiguously identified by an acronym).\n\nThat said this looks like a cool package and we're desperately short on cool time series packages, so consider renaming - why not just `TimeSeriesClassification`? ",
      "createdAt": "2023-08-20T15:05:08Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 3
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1685307048",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85kg2Sx",
      "author": {
        "login": "antoninkriz"
      },
      "authorAssociation": "NONE",
      "body": "I've talked about this with people on the Julia Slack and we came to the same conclusion. I renamed it to `TimeSeriesClassification.jl`. Thanks!",
      "createdAt": "2023-08-21T13:28:39Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1686332593",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85kg3XP",
      "author": {
        "login": "antoninkriz"
      },
      "authorAssociation": "NONE",
      "body": "This PR can be closed thanks to https://github.com/JuliaRegistries/General/pull/90018",
      "createdAt": "2023-08-21T13:31:18Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 1
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1686336975",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85nFX02",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2023-09-21T12:23:01Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1729461558",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85np7KL",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2023-09-28T12:23:05Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89938#issuecomment-1739043467",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: TSC\n- Repository: https://github.com/antoninkriz/TSC.jl\n- Created by: @antoninkriz\n- Version: v1.0.0\n- Commit: 513578cd7854ff7bec4beefa2e2706b903f87ecd\n- Reviewed by: @antoninkriz\n- Reference: https://github.com/antoninkriz/TSC.jl/issues/1#issuecomment-1685102675\n- Description: Time Series Classification algorithms in Julia - Bachelor thesis project\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a8359857b1fc04c99149f8297d6fb2054c5c10984697b7c41a8f39a48c4bb07e2866e88f16edb34d24be1e2a8c23a7edc11f4208ee9e75f7f4f7a4905254947d582a493c6376832c76e6acfe0341ab58a5d463b2d1ceb7b7ad43c525f4a128ef4340b4ecf852ebff0ad81156fc289c6a797b646511b5043151a2314566db0860555dad -->",
  "package_name": "TSC",
  "closed_at": "2023-09-28T12:23:06Z",
  "title": "New package: TSC v1.0.0"
}