{
  "created_at": "2025-06-14T18:16:36Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 132909,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86xM9eO",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 27 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.00 is at or below cutoff of 2.50.\n  2. Similar to SMM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to Run. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to XPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to SMC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to NMF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to ROS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GMAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to ZMQ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to XAM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to XML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to FMI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to KML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to RAI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to QML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to GMT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to UMAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to MAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to IMAS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to RoME. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to NMEA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to NUMA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to ERFA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to ORCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to PRIMA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-06-14T18:22:49Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2972964750",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86xNse8",
      "author": {
        "login": "gabriel-ferr"
      },
      "authorAssociation": "NONE",
      "body": "[noblock] Hello, I would like to request an exception for the package name \"RMA\", which stands for \"Recurrence Microstates Analysis\" (or alternatively, \"Recurrence Motifs Analysis\"). I understand that the name does not meet the current registry requirements (e.g., minimum length and uppercase rule), but the abbreviation is relevant to the topic and aligns with terminology emerging in this area of research.\r\n\r\nIf the name cannot be accepted under any circumstance, I understand and will proceed with renaming the package, such as \"RecurrenceMicrostates\".\r\n\r\nThank you for your consideration.",
      "createdAt": "2025-06-14T20:33:05Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2973157308",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86xOZkn",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "There is probably very little (if any) chance to have a three-letter acronym like `RMA` accepted. My recommendation would be to write out acronym, as `RecurrenceMicrostatesAnalysis`. Differently from other communities, long and descriptive package names are strongly encouraged in the Julia ecosystem, see the [Package naming rules](https://pkgdocs.julialang.org/dev/creating-packages/#Package-naming-rules). This can take some getting used to for people coming from other languages, but once you do, you will find that it makes the ecosystem much more approachable. Fully writing out the acronym would allow you to still use the `RMA` abbreviation in your documentation and \"marketing\", up to and including recommending\r\n\r\n```\r\nimport RecurrenceMicrostatesAnalysis as RMA\r\n```\r\n\r\nas a way to use your package.\r\n\r\nI also noticed that [your API documentation is currently empty](https://dynamicsufpr.github.io/RMA.jl/api/). This might be easy to fix, but if you are registering an initial version `v1.0.0`, and assuming that you intend to adher to [semantic versioning](https://semver.org), I would strongly recommend making sure that the public API of your package is clearly and completely documented. \"Version 1.0.0 defines the public API\" in the semver spec is the crucial distinction between pre-1.0 and 1.0 versions.\r\n\r\nIf the API isn't quite finished yet, or you still want to work on the documentation (there are many other empty sections in the documentation), it's always an option to register with an initial version `v0.1.0`, and then release `v1.0.0` as soon as everything is in place.",
      "createdAt": "2025-06-14T23:29:29Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "HEART",
          "users": {
            "totalCount": 1
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2973341991",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86xOcK4",
      "author": {
        "login": "gabriel-ferr"
      },
      "authorAssociation": "NONE",
      "body": "Understood. I will talk with my professor on Monday (we are also working on an article) and finish the documentation before version 1.0.0. Thank you for your recommendations =D\r\n\r\nEdit: Please feel free to close the pull request. I’ll change the name according to your suggestion.",
      "createdAt": "2025-06-14T23:40:18Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2973352632",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86xR2tM",
      "author": {
        "login": "GunnarFarneback"
      },
      "authorAssociation": "MEMBER",
      "body": "> the abbreviation is relevant to the topic and aligns with terminology emerging in this area of research\r\n\r\nAs an addition, whether an abbreviation is established in some specialized area bears little weight since the General registry is a shared resource between all users of Julia. There's really no way to know if RMA refers to Reliability, Maintainability, and Availability analysis or Rate-Monotonic Analysis, or something completely different. (Those two terms do figure on the wikipedia disambiguation page for RMA.)\r\n",
      "createdAt": "2025-06-15T16:50:53Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 2
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2974247756",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86x2j-B",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closing in favor of https://github.com/JuliaRegistries/General/pull/133125",
      "createdAt": "2025-06-18T11:47:17Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/132909#issuecomment-2983870337",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: RMA\n- Repository: https://github.com/DynamicsUFPR/RMA.jl\n- Created by: @gabriel-ferr\n- Version: v1.0.0\n- Commit: b1a7b8d1a200a573e5a249a3c04defe7184c5470\n- Reviewed by: @gabriel-ferr\n- Reference: https://github.com/DynamicsUFPR/RMA.jl/commit/b1a7b8d1a200a573e5a249a3c04defe7184c5470#commitcomment-160040994\n- Description: A simple and faster library for recurrence microstates analysis.\n<!-- bf0c69308befbd3ccf2cc956ac8a46712550b79fc9bfb5e4edf8f833f05f4c18b06eddad8845b45beb9f45c2b8020dd624e6c4eb78c95a3bcec4749244a4b5f2a44b395701a2cd2ba51c8260aac25e7292c5fcc19865cc901a4e3038db0f41dc889ac2b87003e54cd467d431d79c7c7904f4339420976047b5b1c86129c101c9464b1f4bdca7e3efb66a8773a35350cda02925b64d29733bd28afc2197fb44be000a468e499ea6645c89600a7cbaae9edb552e0791122203d63a12e8fa33800d738b3ac9a1f565b2ba66f4b61e4aff169d5a54ce7042e84f6d995727bd8075c2 -->",
  "package_name": "RMA",
  "closed_at": "2025-06-18T11:47:17Z",
  "title": "New package: RMA v1.0.0"
}