{
  "violations": [],
  "has_violations": false,
  "num_comments": 6,
  "package_author": "PTWaade",
  "decision": {
    "merged": false,
    "closed_by": "ViralBShah",
    "merged_by": null,
    "time_to_decision_days": 50
  },
  "pr_number": 67567,
  "package_name": "HGF",
  "discussion": [
    {
      "influence": 4,
      "author": "PTWaade",
      "author_association": "CONTRIBUTOR",
      "text": "The Hierarchical Gaussian Filter has existed for almost 10 years. It has in all of that time been known in the entire community, as well as the broader behavioral modelling community, as the \"HGF\". There is no other name it can be confused for. There is an earlier MATLAB implementation, which we are moving to Julia, also called 'the HGF Toolbox', as well as a python implementation also just named HGF. For consistency with other implementations, and with common use in the scientific community, it is important the package can be called 'HGF'.",
      "stance": "pro_merge"
    },
    {
      "influence": 3,
      "author": "PTWaade",
      "author_association": "CONTRIBUTOR",
      "text": "I have not received any word since I posted my previous comment 9 days ago, so briefly reposting now as a kind reminder.\r\nTo be clear, I am requesting that the name \"HGF\" can be used for the package in the general registry, despite the fact that it does not meet all of the naming guidelines. If there is anything further I can do in this regard, please inform me, and I shall do my best to be helpful.",
      "stance": "pro_merge"
    },
    {
      "influence": 4,
      "author": "ViralBShah",
      "author_association": "MEMBER",
      "text": "It will be hard to reserve a 3 letter name in General. Honestly, not being in that community, I have no idea what this is. I recommend  \"HierarchicalGaussianFilter.jl\" or something that is at least longer. I know there are existing short names that got registered earlier, but can you reconsider? Is there any other option with HGF and a short suffix?\r\n\r\nMATLAB doesn't have a global registry, and hence not an issue there. HGF in python seems to be something different: https://pypi.org/project/hgf/, which suggests to me that this would be confusing.",
      "stance": "anti_merge"
    },
    {
      "influence": 2,
      "author": "PTWaade",
      "author_association": "CONTRIBUTOR",
      "text": "Okay: I will change the package name.\r\nThank you for the help! All the best from here",
      "stance": "unrelated"
    }
  ],
  "wrapper_info": {
    "is_wrapper": false,
    "wrapped_library": null
  },
  "slack_mentioned": false,
  "justifications": [
    "minimum_length_satisfied"
  ],
  "related_prs": []
}