{
  "created_at": "2024-12-03T10:42:04Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 120583,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86V25rU",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name is not at least 5 characters long\n- Package name similar to 18 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to Jin. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.88 is at or below cutoff of 2.50.\n  2. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to JLD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to Bio. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to Air. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to Git. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to JDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to Jive. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to JOLI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to JET. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to XML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to MKL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to QML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to KML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2024-12-03T10:48:12Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2514197204",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86V5gC7",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "For this type of package, I think a name like `JiL` should be fundamentally okay. However, you'll have to convince a registry maintainer to merge it manually. Since names like `JiL` are somewhat scarce, it is probably much easier to do this if the project is already pretty mature, with full documentation, and there's some community discussion about it. Maybe it would be good to make some kind of [\"pre-announcement\" on Discourse](https://discourse.julialang.org/c/package-announcements/60) to introduce the package and explain your background and motivation for developing this",
      "createdAt": "2024-12-03T15:26:35Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 2
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2514878651",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86XTghn",
      "author": {
        "login": "aptmcl"
      },
      "authorAssociation": "NONE",
      "body": "I'm not sure I understand what is being requested from me. \r\n\r\nAre you saying that either I change the name of the package to something that has five characters or else I need to ask a registry maintainer to manually merge it?\r\n\r\nI rather prefer the second option, so can you tell me the proper way to contact a registry maintainer?",
      "createdAt": "2024-12-12T10:22:29Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2538473575",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86XWcCb",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Yes, that is correct. [As the bot message indicates](https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2514197204), you have to post on the `#pgk-registration` channel on [Slack](https://julialang.org/slack/)",
      "createdAt": "2024-12-12T15:13:54Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2539241627",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86XoCT_",
      "author": {
        "login": "MasonProtter"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "If I understand this package correctly, during initialization, it globally replaces the runtime-wide parser with a new parser that tries to figure out if a piece of code looks lispy, and if it is lispy, it parses using a lisp parser and if not, it'll use julia's parser.\r\n\r\nI must say that even as a lisp enthusiast, this makes me pretty uncomfortable and I don't think this is something that a package in the general registry should be doing, as this behaviour can have profoundly far reaching implications. \r\n\r\nI'd be much more comfortable if instead you had a `lispinclude` function that `include`s code parsed using your lisp parser, and then made a special repl mode (like what REPLMaker.jl does) that lets people use lisp syntax in the REPL if they opt into it. \r\n\r\nAs it is currently, simply `using` this package in a sub-dependancy can have highly non-local disruptive effects in completely different modules...",
      "createdAt": "2024-12-15T12:29:35Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 1
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2543854847",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86Xokey",
      "author": {
        "login": "aptmcl"
      },
      "authorAssociation": "NONE",
      "body": "I understand your discomfort and, clearly, this package is an experiment on making Julia more like Racket, not only in the use of fully-parenthesized prefix syntax, but also in the support for program files written in different syntaxes, including the original Julia syntax. Those who will use it should expect the parser to change, hopefully, in a backwards-compatible way.\r\n\r\nI don't know what is expected from me at this moment. Can you tell me which of the following is needed for the package to be registered?\r\n\r\n1. Change the name of the package so that it complies with the automatic merge guidelines?\r\n2. Change the implementation of the package, providing the `lispinclude` function that you mention, along with the special REPL mode?\r\n3. Something else?\r\n\r\nThanks in advance.",
      "createdAt": "2024-12-15T18:36:59Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2543994802",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86XpJYo",
      "author": {
        "login": "MasonProtter"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "> Those who will use it should expect the parser to change, hopefully, in a backwards-compatible way.\r\n\r\nWhat I mean though is that since you're calling `Core._setparser!(lang_parse)`, you're changing the parser used by all packages in the session non-locally, not just in the namespace or file where the user intends to use JiL (this would even affect `Base` if something got `include`ed after this package was loaded!) . That's what makes me a bit hesitant about this being in the general registry, because then it can be made a dependancy of a package and if someone loads some other random package, this could cause weird and hard to debug parsing errors even though the user might not have loaded `JiL` themselves.\r\n\r\n\r\n\r\n> I don't know what is expected from me at this moment. Can you tell me which of the following is needed for the package to be registered?\r\n\r\nSorry, I should have been more clear. I am also not a registry maintainer and I don't have the rights to approve or deny your package. I am just giving my feedback as to why I am a bit uncomfortable with the implementation itself so that you can consider that feedback, and so that whichever  registry maintainer ends up looking at this knows about that extra context (i.e. that this is potentially not just a naming issue). \r\n\r\nThat said, we usually don't block packages from registration just because they're doing something that a rando like me thinks is a bad idea. I just thought I'd flag it just in case it is important. \r\n\r\n___________\r\n\r\nSeparately, I should also say this is a really cool package and I love to see people playing around with this stuff! It's very neat, (I'm just not totally sure it is a good fit for the general registry -- but I'm also not convinced it *shouldnt* be registed)",
      "createdAt": "2024-12-15T22:40:18Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2544145960",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86aiO5Y",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2025-01-15T12:23:40Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2592665176",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86bZVoz",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2025-01-22T12:23:52Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/120583#issuecomment-2607110707",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: JiL\n- Repository: https://github.com/aptmcl/JiL.jl\n- Created by: @aptmcl\n- Version: v0.1.0\n- Commit: 7b1030b079d7f1b8976acb428921607b6e138f47\n- Reviewed by: @aptmcl\n- Reference: https://github.com/aptmcl/JiL.jl/commit/7b1030b079d7f1b8976acb428921607b6e138f47#commitcomment-149868785\n- Description: The JiL programming language: a Lisp dialect on top of Julia.\n<!-- bf0c69308befbd3ccf2cc956ac8a46712550b79fc9bfb5e4edf8f833f05f4c18b06eddad8845b45beb9f45c2b8020dd6080a9af50c5da7305379476a27b2980a0070c09b305f276f8dd0f0c3d888df6971fefa0abbf047a3001f17d9608008c7d1ecf95c95604360d44656b9426baa05a5c883b9a352fbc63033acba8871fc6f7b5a2aa66ce412b040709f70983c865f56d83b58411e0f7058ad988e8e9debd4be4f27a9e9764ed2e8e114f6f7256d503682aff0e4d312f20e8391b2971356af9550aab9cf45166507110c17b2e11224 -->",
  "package_name": "JiL",
  "closed_at": "2025-01-22T12:23:52Z",
  "title": "New package: JiL v0.1.0"
}