{
  "created_at": "2021-03-18T02:33:52Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "merged_at": "2021-03-21T16:01:16Z",
  "pr_number": 32242,
  "comments": [
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgwMTU3MTkzOA==",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an uppercase letter, ASCII alphanumerics only, not all letters are uppercase.\n- Name is not at least five characters long\n- Package name similar to 6 existing packages.\n  1. Similar to CDCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.91 is at or below cutoff of 2.50.\n  2. Similar to COBS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to CBOR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to CAOS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to BLIS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to TBLIS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-03-18T02:36:49Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/32242#issuecomment-801571938",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDgwMTU3NDA4NQ==",
      "author": {
        "login": "Azzaare"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hi there!\r\nThis package is a MOI/JuMP interface for `LocalSearchSolvers.jl` (already registered) which is a framework for Constraint-Based Local Search (CBLS).\r\nThe name CBLS was chosen to be meaningful and short for the use of specialists. Other users will likely be directed towards `LocalSearchSolvers.jl`.\r\nPlease let me know if it is a problem.",
      "createdAt": "2021-03-18T02:41:49Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/32242#issuecomment-801574085",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": "giordano",
  "body": "- Registering package: CBLS\n- Repository: https://github.com/JuliaConstraints/CBLS.jl\n- Created by: @Azzaare\n- Version: v0.1.0\n- Commit: 4a327189f173b370eec57a4e4522bfcd2f0bf11a\n- Git reference: main",
  "package_name": "CBLS",
  "title": "New package: CBLS v0.1.0"
}