{
  "created_at": "2025-04-29T20:17:23Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "goerz",
  "merged_at": null,
  "pr_number": 130021,
  "comments": [
    {
      "id": "IC_kwDOBhF1q86pSU79",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Hello, I am an automated registration bot. I help manage the registration process by checking your registration against a set of [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). If all these guidelines are met, this pull request will be merged automatically, completing your registration. It is **strongly recommended** to follow the guidelines, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\n## 1. New package registration\n\nPlease make sure that you have read the [package naming guidelines](https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1).\n\n## 2. [AutoMerge Guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/) which are not met ❌\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- There is no compat entry for `julia`.\n- Package name similar to 26 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to ODE. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 1.61 is at or below cutoff of 2.50.\n  2. Similar to BDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.04 is at or below cutoff of 2.50.\n  3. Similar to EDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.12 is at or below cutoff of 2.50.\n  4. Similar to CAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2. Normalized visual distance 2.19 is at or below cutoff of 2.50.\n  5. Similar to LNR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to C3D. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to FDM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to SVR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to JDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to CRC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to XDF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to Cbc. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to MD5. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to Cxx. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to CDCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to ADI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to Clp. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to CUDD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to CUDA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to CSDP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to CBOR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to CoDa. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to GR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to TLDR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to GCP. Normalized visual distance 2.38 is at or below cutoff of 2.50.\n\n  </details>\n\n\n## 3. *Needs action*: here's what to do next\n\n1. Please try to update your package to conform to these guidelines. The [General registry's README](https://github.com/JuliaRegistries/General/blob/master/README.md) has an FAQ that can help figure out how to do so.\n2. After you have fixed the AutoMerge issues, simply retrigger Registrator, the same way you did in the initial registration. This will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless the AutoMerge issue is that you skipped a version number).\n\nIf you need help fixing the AutoMerge issues, or want your pull request to be manually merged instead, please post a comment explaining what you need help with or why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [public Julia Slack](https://julialang.org/slack/) for better visibility.\n\n## 4. To pause or stop registration\n\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n\n_Tip: You can edit blocking comments to add `[noblock]` in order to unblock auto-merging._\n\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2025-04-29T20:23:47Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/130021#issuecomment-2840153853",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86pSyO2",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "This should probably be named `CommonDataRepresentation.jl`",
      "createdAt": "2025-04-29T21:18:52Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/130021#issuecomment-2840273846",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86pS9_S",
      "author": {
        "login": "BenChung"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "@goerz I don't like `CommonDataRepresentation.jl` because the name implies a generality that CDR doesn't really have. OMG CDR is common... but it's not _that_ common. In my experience, if you say \"common data representation\" you're much more likely to get question marks in response compared to \"CDR.\" As a result, I find that name rather misleading. It's like naming a `XML` package `ExtensibleMarkupLanguage.jl`.\r\n\r\nI strongly prefer the initialism because in my experience it's more widely known and used than the expansion thereof. I'd prefer to add qualifiers to the name of this package (`CDRSerialization`? Using `OMG` is probably not great since there's no actual affiliation) vs. expanding the initialism. I don't have a strong opinion about what qualifiers are used, though.",
      "createdAt": "2025-04-29T21:47:47Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [
        {
          "content": "THUMBS_UP",
          "users": {
            "totalCount": 1
          }
        }
      ],
      "url": "https://github.com/JuliaRegistries/General/pull/130021#issuecomment-2840322002",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q86pUHjH",
      "author": {
        "login": "goerz"
      },
      "authorAssociation": "MEMBER",
      "body": "Closing in favor of https://github.com/JuliaRegistries/General/pull/130030",
      "createdAt": "2025-04-30T02:05:42Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/130021#issuecomment-2840623303",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: CDR\n- Repository: https://github.com/BenChung/CDR.jl\n- Created by: @BenChung\n- Version: v0.1.0\n- Commit: 56b72dfd25751bf60a1a885535ae73e9073023c7\n- Reviewed by: @BenChung\n- Reference: https://github.com/BenChung/CDR.jl/commit/56b72dfd25751bf60a1a885535ae73e9073023c7#commitcomment-156082398\n<!-- bf0c69308befbd3ccf2cc956ac8a46712550b79fc9bfb5e4edf8f833f05f4c18b06eddad8845b45beb9f45c2b8020dd673cfb540759862c6c662217f710496b3a167d7cb877a72eed443825d146cea49e069a03eb28e7cda267edeac39f426c38f68d92fe4b2b13a2f7825ccc2a28bc1e80938c72334090b7b5a5645c767332b774671ff8cc44dae115a7fe340d9d3dd09420cf1cfd0e4e327436cdc047915a991b1d2c3fdc1bfafd60b808eb401a3f392bfe3cf7f01f6237f325517c60f9ca0236875949a1775b27f38a050da960405 -->",
  "package_name": "CDR",
  "closed_at": "2025-04-30T02:05:42Z",
  "title": "New package: CDR v0.1.0"
}