{
  "created_at": "2023-04-13T16:05:18Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "giordano",
  "merged_at": null,
  "pr_number": 81549,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85Z1qdG",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name is not at least 5 characters long\n- There is no compat entry for `julia`.\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: AMDGPU, BenchmarkTools, CUDA, CUDAKernels, DataStructures, ImageIO, Images, KernelAbstractions, Literate, MacroTools, ROCKernels, Unitful, UnsafeAtomics, VideoIO\n- Package name similar to 13 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to Yao. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  2. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to Tau. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to Tar. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to FDM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to Fri. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to FMI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to FIB. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to Fire. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to Faker. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to Lale. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to Fjage. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to FAME. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [Julia Slack](https://julialang.org/slack/) to ask for help. Include a link to this pull request.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2023-04-13T16:16:00Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/81549#issuecomment-1507239750",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: Fae\n- Repository: https://github.com/leios/Fae.jl\n- Created by: @leios\n- Version: v0.0.1\n- Commit: d3e73febf5374a4d41585062898899499bc53c1b\n- Reviewed by: @leios\n- Reference: https://github.com/leios/Fae.jl/issues/20#issuecomment-1507225259\n- Description: General purpose animations via iterated function systems\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a83598f10d87aa6d1f05b8c97bd52720180113d24e99c21c5fe79180a931a967b224230f63d69d574af795d482df6234a1d7397ed832b2dd3c7f76555924c8184cca08a5a67ffd1a62cbe6f42ef3a9988fac1fbf9682965e5165715672993ade27797a122219ad6f473fac638ef912f51a9b9a -->",
  "package_name": "Fae",
  "closed_at": "2023-04-13T18:49:37Z",
  "title": "New package: Fae v0.0.1"
}