{
  "created_at": "2021-12-31T01:49:17Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "github-actions[bot]",
  "merged_at": null,
  "pr_number": 51458,
  "comments": [
    {
      "id": "IC_kwDOBhF1q847zDJl",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Package name similar to 29 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to SHA. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 0.60 is at or below cutoff of 2.50.\n  2. Similar to SMM. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.27 is at or below cutoff of 2.50.\n  3. Similar to SMC. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.00 is at or below cutoff of 2.50.\n  4. Similar to GMAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  5. Similar to SOM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  6. Similar to SPH. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  7. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  8. Similar to ZMQ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to XPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to GMT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to QML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to SVR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to NMF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to FCA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to SCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to SEAL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to UMAP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to XAM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to SBML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to FMI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to SDMX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to MAT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to SOFA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to SDPA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to NMEA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to SIAN. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to TSML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  28. Similar to SIMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  29. Similar to COSMA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-12-31T01:53:09Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/51458#issuecomment-1003237989",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q849GlJS",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for 30 days and will be automatically closed 7 days from now. If this pull request should not be closed, please either (1) fix the AutoMerge issues and re-trigger Registrator, which will automatically update the pull request, or (2) post a comment explaining why you would like this pull request to be manually merged. [noblock]",
      "createdAt": "2022-01-30T12:40:28Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/51458#issuecomment-1025135186",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q849emdZ",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "This pull request has been inactive for more than 30 days and has automatically been closed. Feel free to register your package or version again once you fix the AutoMerge issues. [noblock]",
      "createdAt": "2022-02-07T12:47:27Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/51458#issuecomment-1031432025",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: SMA\n- Repository: https://github.com/hondoRandale/SMA.jl\n- Created by: @hondoRandale\n- Version: v0.1.0\n- Commit: 745e19c32ca1aa5250bdc914bee68929908bfa0a\n- Git reference: HEAD\n- Description: Slime Mold swarm optimization\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n> initial commit, working fine, documentation is coming soon ...\n<!-- END RELEASE NOTES -->",
  "package_name": "SMA",
  "closed_at": "2022-02-07T12:47:27Z",
  "title": "New package: SMA v0.1.0"
}