{
  "created_at": "2022-12-28T13:29:21Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "DilumAluthge",
  "merged_at": null,
  "pr_number": 74719,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85RdYjQ",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an upper-case letter, ASCII alphanumerics only, not all letters are upper-case.\n- Name is not at least 5 characters long\n- Repo URL does not end with /name.jl.git, where name is the package name\n- Package name similar to 35 existing packages.\n  <details>\n  <summary>Similar package names</summary>\n\n  1. Similar to SMC. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.16 is at or below cutoff of 2.50.\n  2. Similar to QML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 1.45 is at or below cutoff of 2.50.\n  3. Similar to XML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.12 is at or below cutoff of 2.50.\n  4. Similar to KML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 2.35 is at or below cutoff of 2.50.\n  5. Similar to SMM. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  6. Similar to SBML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  7. Similar to TSML. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n  8. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  9. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  10. Similar to AMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  11. Similar to NMF. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  12. Similar to GMT. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  13. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  14. Similar to ZMQ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  15. Similar to SPH. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  16. Similar to MKL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  17. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  18. Similar to ISL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  19. Similar to SCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  20. Similar to FMI. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  21. Similar to SOM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  22. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  23. Similar to SVR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  24. Similar to TMLE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  25. Similar to SPPL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  26. Similar to GLM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  27. Similar to QSM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  28. Similar to SEAL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  29. Similar to SDMX. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  30. Similar to MLJ. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  31. Similar to HAML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  32. Similar to YAML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  33. Similar to TOML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  34. Similar to SIMD. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  35. Similar to CSFML. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\n  </details>\n\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2022-12-28T13:33:36Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/74719#issuecomment-1366657232",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85R7hu7",
      "author": {
        "login": "mcabbott"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Replaced by #74936 ",
      "createdAt": "2023-01-07T18:13:42Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/74719#issuecomment-1374559163",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: SML\n- Repository: https://github.com/SammithSB/LearninML.jl\n- Created by: @SammithSB\n- Version: v0.1.0\n- Commit: 36cd443ea3f1e9d3166b0a9dfdd99ba5d9dfc98a\n- Reviewed by: @SammithSB\n- Reference: https://github.com/SammithSB/LearninML.jl/issues/2#issuecomment-1369106744\n<!-- bf0c69308befbd3ccf2cc956ac8a4671113b158fd87a6d4e741b0173dab051a48f7dc43e593ffff4357bc647a3a8359897af89eba97ec1a7a2fe22c642238fe568e5395ca0913823cb98a03ccbc1aeef4bc6dbf98edcc0444abe3e8af5a7e83bff147e766ffa3ac24972e275d7e8c2436a35a129ea14d22b5f2dbf75820f1568ae2ae5ffd933731cc91387db68265b2ba3eb239cdf9ab4a3ab813fa1bf92e5a2fa330db8418b4634b9df9ae0b389f6d3 -->",
  "package_name": "SML",
  "closed_at": "2023-02-25T00:08:28Z",
  "title": "New package: SML v0.1.0"
}