{
  "created_at": "2021-01-17T07:38:14Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "closed_by": "fredrikekre",
  "merged_at": null,
  "pr_number": 28106,
  "comments": [
    {
      "id": "MDEyOklzc3VlQ29tbWVudDc2MTc0OTE2OA==",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md). The following guidelines were not met:\n\n- Name does not meet all of the following: starts with an uppercase letter, ASCII alphanumerics only, not all letters are uppercase.\n- Name is not at least five characters long\n- The following dependencies do not have a `[compat]` entry that is upper-bounded and only includes a finite number of breaking releases: SpecialFunctions\n- Package name similar to 20 existing packages.\n<details>\n<summary>Similar package names</summary>\n\n1. Similar to GR. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1. Normalized visual distance 0.72 is at or below cutoff of 2.50.\n2. Similar to SVR. Damerau-Levenshtein distance 1 is at or below cutoff of 2. Damerau-Levenshtein distance 1 between lowercased names is at or below cutoff of 1.\n3. Similar to Z3. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n4. Similar to H3. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n5. Similar to CRC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n6. Similar to SPH. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n7. Similar to Tk. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n8. Similar to GSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n9. Similar to SMC. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n10. Similar to SHA. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n11. Similar to SCS. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n12. Similar to CSV. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n13. Similar to HSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n14. Similar to LSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n15. Similar to SMM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n16. Similar to SOM. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n17. Similar to DSP. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n18. Similar to VSL. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n19. Similar to ASE. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n20. Similar to LNR. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n</details>\n\n- I was not able to load the package (i.e. `import SR` failed). See the CI logs for details.\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2021-01-17T07:42:10Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/28106#issuecomment-761749168",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDc2MTc0OTU0Mw==",
      "author": {
        "login": "MilesCranmer"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Block automerge",
      "createdAt": "2021-01-17T07:46:38Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/28106#issuecomment-761749543",
      "viewerDidAuthor": false
    },
    {
      "id": "MDEyOklzc3VlQ29tbWVudDc2MTc1MTA2Mw==",
      "author": {
        "login": "MilesCranmer"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "FYI: I have renamed the package to SymbolicRegression.jl to satisfy the naming requirements.\r\n\r\nSee #28107 ",
      "createdAt": "2021-01-17T08:00:15Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/28106#issuecomment-761751063",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": null,
  "body": "- Registering package: SR\n- Repository: https://github.com/MilesCranmer/SymbolicRegression.jl\n- Created by: @MilesCranmer\n- Version: v0.1.0\n- Commit: 24760f851a9500269a04e1beb677d0ea64c00c26\n- Git reference: master",
  "package_name": "SR",
  "closed_at": "2021-01-17T10:52:09Z",
  "title": "New package: SR v0.1.0"
}