{
  "created_at": "2023-08-11T13:08:48Z",
  "review_comments": [],
  "state": "closed",
  "author": "JuliaRegistrator",
  "merged_at": "2023-08-18T10:02:12Z",
  "pr_number": 89443,
  "comments": [
    {
      "id": "IC_kwDOBhF1q85j003x",
      "author": {
        "login": "github-actions"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "Your `new package` pull request does not meet the guidelines for auto-merging. Please make sure that you have read the [General registry README](https://github.com/JuliaRegistries/General/blob/master/README.md) and the [AutoMerge guidelines](https://juliaregistries.github.io/RegistryCI.jl/stable/guidelines/). The following guidelines were not met:\n\n- Package name similar to 4 existing packages.\n  1. Similar to Mongoc. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  2. Similar to Mangal. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  3. Similar to Minio. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n  4. Similar to Zalgo. Damerau-Levenshtein distance 2 is at or below cutoff of 2.\n\nNote that the guidelines are only required for the pull request to be merged automatically. However, it is **strongly recommended** to follow them, since otherwise the pull request needs to be manually reviewed and merged by a human.\n\nAfter you have fixed the AutoMerge issues, simple retrigger Registrator, which will automatically update this pull request. You do not need to change the version number in your `Project.toml` file (unless of course the AutoMerge issue is that you skipped a version number, in which case you should change the version number).\n\nIf you do not want to fix the AutoMerge issues, please post a comment explaining why you would like this pull request to be manually merged. Then, send a message to the `#pkg-registration` channel in the [Julia Slack](https://julialang.org/slack/) to ask for help. Include a link to this pull request.\n\nSince you are registering a new package, please make sure that you have also read the package naming guidelines: https://julialang.github.io/Pkg.jl/dev/creating-packages/#Package-naming-guidelines-1\n\n\n\n---\nIf you want to prevent this pull request from being auto-merged, simply leave a comment. If you want to post a comment without blocking auto-merging, you must include the text `[noblock]` in your comment. You can edit blocking comments, adding `[noblock]` to them in order to unblock auto-merging.\n<!-- [noblock] -->\n<!---\nthis_is_the_single_automerge_comment\n--->",
      "createdAt": "2023-08-11T13:25:08Z",
      "includesCreatedEdit": true,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89443#issuecomment-1674792433",
      "viewerDidAuthor": false
    },
    {
      "id": "IC_kwDOBhF1q85j1LQr",
      "author": {
        "login": "rcschrg"
      },
      "authorAssociation": "CONTRIBUTOR",
      "body": "[noblock]\r\nThe package-name is clearly different from the mentioned packages, Mongoc Mangal, Minio and Zalgo.\r\n\r\nMango.jl is named after its \"twin\" python framework, also developed by our organization, https://gitlab.com/mango-agents/mango, which is why we would like to be able to keep the name Mango.jl as it is.",
      "createdAt": "2023-08-11T14:26:37Z",
      "includesCreatedEdit": false,
      "isMinimized": false,
      "minimizedReason": "",
      "reactionGroups": [],
      "url": "https://github.com/JuliaRegistries/General/pull/89443#issuecomment-1674884139",
      "viewerDidAuthor": false
    }
  ],
  "merged_by": "ericphanson",
  "body": "- Registering package: Mango\n- Repository: https://gitlab.com/mango-agents/Mango.jl\n- Created by: https://gitlab.com/rcschrg\n- Version: v0.1.0\n- Commit: afdca0c29df659bf01669e782abd6a5ff641fc23\n- Git reference: v0.1.0\n- Release notes:\n<!-- BEGIN RELEASE NOTES -->\n> Release of the first version of Mango.jl. It allows the user to create simple agents with little effort and, at the same time, offers options to structure agents with complex behavior. The initially available features of mango are as follows.\n> * Container mechanism to speedup local message exchange\n> * Structuring complex agents with loose coupling and agent roles\n> * Built-in codecs\n> * Supports communication between agents directly via TCP\n<!-- END RELEASE NOTES -->",
  "package_name": "Mango",
  "title": "New package: Mango v0.1.0"
}